<a href="https://colab.research.google.com/github/mohd-faizy/Lib_Pandas/blob/master/00_Pandas_basic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# __Pandas Basics__

In [1]:
import numpy as np
import pandas as pd

In [2]:
dict_1 = {
    'name':['faizy', 'rahul', 'arjun', 'mike'], 
    'marks':[70, 50, 30, 20],
    'city':['bijnor', 'delhi', 'noida', 'antartica']
}

In [3]:
# Changing it to a pandas dataframe
df = pd.DataFrame(dict_1)   # Check: DataFrame should be in camel case

In [4]:
# Changing it to a CSV format 
df.to_csv('classmates.csv')

In [5]:
df.to_csv('classmates_index_false.csv', index =  False)

In [6]:
df.head(2)

    name  marks    city
0  faizy     70  bijnor
1  rahul     50   delhi

In [7]:
df.tail(2)

    name  marks       city
2  arjun     30      noida
3   mike     20  antartica

In [8]:
df.describe()

           marks
count   4.000000
mean   42.500000
std    22.173558
min    20.000000
25%    27.500000
50%    40.000000
75%    55.000000
max    70.000000

In [9]:
data = pd.read_csv('/content/classmates_index_false.csv')

In [10]:
data

    name  marks       city
0  faizy     70     bijnor
1  rahul     50      delhi
2  arjun     30      noida
3   mike     20  antartica

In [11]:
data['marks'][1] = 60

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [12]:
data

    name  marks       city
0  faizy     70     bijnor
1  rahul     60      delhi
2  arjun     30      noida
3   mike     20  antartica

In [13]:
data.index = ['first', 'second', 'third', 'fourth']

In [14]:
data

         name  marks       city
first   faizy     70     bijnor
second  rahul     60      delhi
third   arjun     30      noida
fourth   mike     20  antartica

In [15]:
type(data)

pandas.core.frame.DataFrame

In [16]:
dataframe_series = pd.Series(np.random.rand(30))

In [17]:
dataframe_series

0     0.038125
1     0.892151
2     0.252819
3     0.412964
4     0.283194
5     0.788055
6     0.282857
7     0.916398
8     0.118778
9     0.570749
10    0.344149
11    0.638034
12    0.959320
13    0.509562
14    0.621065
15    0.972449
16    0.579233
17    0.171236
18    0.424634
19    0.741177
20    0.086229
21    0.897127
22    0.416209
23    0.658531
24    0.967740
25    0.451948
26    0.553707
27    0.075519
28    0.370638
29    0.525187
dtype: float64

In [18]:
type(dataframe_series)

pandas.core.series.Series

In [19]:
new_df = pd.DataFrame(np.random.rand(300, 5), index = np.arange(300))

In [20]:
new_df

            0         1         2         3         4
0    0.325324  0.351516  0.747502  0.252251  0.063048
1    0.560306  0.761380  0.739760  0.060856  0.165792
2    0.482958  0.879773  0.755738  0.736851  0.203240
3    0.965470  0.957761  0.214800  0.884814  0.887049
4    0.946059  0.005710  0.167932  0.180200  0.388442
..        ...       ...       ...       ...       ...
295  0.607624  0.940568  0.854900  0.114394  0.821349
296  0.840378  0.791238  0.029959  0.341883  0.332195
297  0.420904  0.209322  0.322336  0.504221  0.694428
298  0.306647  0.221617  0.113838  0.074223  0.946116
299  0.978009  0.063214  0.930707  0.242679  0.443807

[300 rows x 5 columns]

In [21]:
type(new_df)

pandas.core.frame.DataFrame

In [22]:
new_df.describe()

                0           1           2           3           4
count  300.000000  300.000000  300.000000  300.000000  300.000000
mean     0.491065    0.476691    0.520085    0.510799    0.492415
std      0.284702    0.300902    0.288945    0.294422    0.277200
min      0.000113    0.004334    0.002997    0.000664    0.000236
25%      0.276592    0.210468    0.260371    0.236662    0.273237
50%      0.471016    0.465465    0.559810    0.541988    0.489698
75%      0.732006    0.752242    0.769350    0.764119    0.722180
max      0.999886    0.998731    0.988223    0.996340    0.998252

In [23]:
new_df.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [24]:
new_df[0][0] = 'faizy'

In [25]:
new_df.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [26]:
new_df.head()

          0         1         2         3         4
0     faizy  0.351516  0.747502  0.252251  0.063048
1  0.560306  0.761380  0.739760  0.060856  0.165792
2  0.482958  0.879773  0.755738  0.736851  0.203240
3   0.96547  0.957761  0.214800  0.884814  0.887049
4  0.946059  0.005710  0.167932  0.180200  0.388442

In [27]:
new_df.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            290, 291, 292, 293, 294, 295, 296, 297, 298, 299],
           dtype='int64', length=300)

In [28]:
new_df.columns

RangeIndex(start=0, stop=5, step=1)

In [29]:
new_df.to_numpy()

array([['faizy', 0.35151614917123497, 0.7475020073070875,
        0.2522511354492333, 0.06304827733550167],
       [0.5603058921969208, 0.7613796423652764, 0.7397602118142523,
        0.06085602797445655, 0.16579227704054156],
       [0.48295760770977647, 0.8797725686187234, 0.7557381817574069,
        0.7368509622197236, 0.20323968160499972],
       ...,
       [0.42090376069087143, 0.2093221308451153, 0.32233584755954936,
        0.5042214467701293, 0.6944275225391867],
       [0.3066469699894766, 0.22161676080021975, 0.11383797189914335,
        0.07422288737814497, 0.946116354400893],
       [0.9780086472107105, 0.06321366949400431, 0.9307069795319706,
        0.24267938010656853, 0.4438068190684925]], dtype=object)

In [30]:
new_df[0][0] = 0.3982178349281

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [31]:
# DataFrame Transpose
new_df.T

         0         1         2    ...       297        298        299
0   0.398218  0.560306  0.482958  ...  0.420904   0.306647   0.978009
1   0.351516   0.76138  0.879773  ...  0.209322   0.221617  0.0632137
2   0.747502   0.73976  0.755738  ...  0.322336   0.113838   0.930707
3   0.252251  0.060856  0.736851  ...  0.504221  0.0742229   0.242679
4  0.0630483  0.165792   0.20324  ...  0.694428   0.946116   0.443807

[5 rows x 300 columns]

In [32]:
new_df.head()

          0         1         2         3         4
0  0.398218  0.351516  0.747502  0.252251  0.063048
1  0.560306  0.761380  0.739760  0.060856  0.165792
2  0.482958  0.879773  0.755738  0.736851  0.203240
3   0.96547  0.957761  0.214800  0.884814  0.887049
4  0.946059  0.005710  0.167932  0.180200  0.388442

In [33]:
new_df.sort_index(axis=0, ascending=False)

            0         1         2         3         4
299  0.978009  0.063214  0.930707  0.242679  0.443807
298  0.306647  0.221617  0.113838  0.074223  0.946116
297  0.420904  0.209322  0.322336  0.504221  0.694428
296  0.840378  0.791238  0.029959  0.341883  0.332195
295  0.607624  0.940568  0.854900  0.114394  0.821349
..        ...       ...       ...       ...       ...
4    0.946059  0.005710  0.167932  0.180200  0.388442
3     0.96547  0.957761  0.214800  0.884814  0.887049
2    0.482958  0.879773  0.755738  0.736851  0.203240
1    0.560306  0.761380  0.739760  0.060856  0.165792
0    0.398218  0.351516  0.747502  0.252251  0.063048

[300 rows x 5 columns]

In [34]:
new_df.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.063048  0.252251  0.747502  0.351516  0.398218
1    0.165792  0.060856  0.739760  0.761380  0.560306
2    0.203240  0.736851  0.755738  0.879773  0.482958
3    0.887049  0.884814  0.214800  0.957761   0.96547
4    0.388442  0.180200  0.167932  0.005710  0.946059
..        ...       ...       ...       ...       ...
295  0.821349  0.114394  0.854900  0.940568  0.607624
296  0.332195  0.341883  0.029959  0.791238  0.840378
297  0.694428  0.504221  0.322336  0.209322  0.420904
298  0.946116  0.074223  0.113838  0.221617  0.306647
299  0.443807  0.242679  0.930707  0.063214  0.978009

[300 rows x 5 columns]

$axis=0$ $\rightarrow$ $Row$

$axis=1$ $\rightarrow$ $Column$

In [35]:
 new_df.head()

          0         1         2         3         4
0  0.398218  0.351516  0.747502  0.252251  0.063048
1  0.560306  0.761380  0.739760  0.060856  0.165792
2  0.482958  0.879773  0.755738  0.736851  0.203240
3   0.96547  0.957761  0.214800  0.884814  0.887049
4  0.946059  0.005710  0.167932  0.180200  0.388442

In [36]:
new_df[0]

0      0.398218
1      0.560306
2      0.482958
3       0.96547
4      0.946059
         ...
295    0.607624
296    0.840378
297    0.420904
298    0.306647
299    0.978009
Name: 0, Length: 300, dtype: object

In [37]:
type(new_df[0])

pandas.core.series.Series

$DataFrame$ is the combination of $Series$.

In [38]:
new_df_N = new_df

In [39]:
new_df_N[0][0] = 786

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [40]:
new_df.head()

          0         1         2         3         4
0       786  0.351516  0.747502  0.252251  0.063048
1  0.560306  0.761380  0.739760  0.060856  0.165792
2  0.482958  0.879773  0.755738  0.736851  0.203240
3   0.96547  0.957761  0.214800  0.884814  0.887049
4  0.946059  0.005710  0.167932  0.180200  0.388442

This indicate that `new_df_N` is a $view$ of `new_df`

In [41]:
new_df_N = new_df.copy()

In [42]:
new_df_N[0][0] = 786.786

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [43]:
new_df.head()

          0         1         2         3         4
0       786  0.351516  0.747502  0.252251  0.063048
1  0.560306  0.761380  0.739760  0.060856  0.165792
2  0.482958  0.879773  0.755738  0.736851  0.203240
3   0.96547  0.957761  0.214800  0.884814  0.887049
4  0.946059  0.005710  0.167932  0.180200  0.388442

In [44]:
new_df_N.head()

          0         1         2         3         4
0   786.786  0.351516  0.747502  0.252251  0.063048
1  0.560306  0.761380  0.739760  0.060856  0.165792
2  0.482958  0.879773  0.755738  0.736851  0.203240
3   0.96547  0.957761  0.214800  0.884814  0.887049
4  0.946059  0.005710  0.167932  0.180200  0.388442

In [45]:
new_df.loc[0, 0] = 12345

In [46]:
new_df.head(2)

          0         1         2         3         4
0     12345  0.351516  0.747502  0.252251  0.063048
1  0.560306  0.761380  0.739760  0.060856  0.165792

In [47]:
new_df.columns = list('ABCDE')

In [48]:
new_df.head()

          A         B         C         D         E
0     12345  0.351516  0.747502  0.252251  0.063048
1  0.560306  0.761380  0.739760  0.060856  0.165792
2  0.482958  0.879773  0.755738  0.736851  0.203240
3   0.96547  0.957761  0.214800  0.884814  0.887049
4  0.946059  0.005710  0.167932  0.180200  0.388442

In [49]:
new_df.loc[0, 'A'] = 0.54321

In [50]:
new_df.head(3)

          A         B         C         D         E
0   0.54321  0.351516  0.747502  0.252251  0.063048
1  0.560306  0.761380  0.739760  0.060856  0.165792
2  0.482958  0.879773  0.755738  0.736851  0.203240

In [51]:
new_df.loc[0, 'a'] = 0.54321

In [52]:
new_df.head(3)

          A         B         C         D         E        a
0   0.54321  0.351516  0.747502  0.252251  0.063048  0.54321
1  0.560306  0.761380  0.739760  0.060856  0.165792      NaN
2  0.482958  0.879773  0.755738  0.736851  0.203240      NaN

In [53]:
# Dropping the column
new_df = new_df.drop('a', axis=1)

In [54]:
new_df.head(3)

          A         B         C         D         E
0   0.54321  0.351516  0.747502  0.252251  0.063048
1  0.560306  0.761380  0.739760  0.060856  0.165792
2  0.482958  0.879773  0.755738  0.736851  0.203240

In [55]:
new_df.loc[[1, 2], ['A', 'B']]

          A         B
1  0.560306  0.761380
2  0.482958  0.879773

In [56]:
new_df.loc[:, ['A', 'B']].head(5)

          A         B
0   0.54321  0.351516
1  0.560306  0.761380
2  0.482958  0.879773
3   0.96547  0.957761
4  0.946059  0.005710

In [57]:
new_df.loc[[1, 2], :]

          A         B         C         D         E
1  0.560306  0.761380  0.739760  0.060856  0.165792
2  0.482958  0.879773  0.755738  0.736851  0.203240

In [58]:
new_df.loc[(new_df['A'] > 0.5)].head(5)

          A         B         C         D         E
0   0.54321  0.351516  0.747502  0.252251  0.063048
1  0.560306  0.761380  0.739760  0.060856  0.165792
3   0.96547  0.957761  0.214800  0.884814  0.887049
4  0.946059  0.005710  0.167932  0.180200  0.388442
8   0.78169  0.874851  0.749604  0.188263  0.634419

In [59]:
new_df.loc[(new_df['A'] > 0.5) & (new_df['B'] < 0.6)].head(5)

           A         B         C         D         E
0    0.54321  0.351516  0.747502  0.252251  0.063048
4   0.946059  0.005710  0.167932  0.180200  0.388442
15  0.613584  0.017867  0.367616  0.082913  0.343501
18  0.963344  0.558653  0.167860  0.379226  0.889201
20  0.692984  0.050741  0.374167  0.454608  0.339128

In [60]:
new_df.head(3)

          A         B         C         D         E
0   0.54321  0.351516  0.747502  0.252251  0.063048
1  0.560306  0.761380  0.739760  0.060856  0.165792
2  0.482958  0.879773  0.755738  0.736851  0.203240

In [61]:
new_df.iloc[0, 4]

0.06304827733550167

`.loc` $vs$ `.iloc`
---
`loc` gets rows (or columns) with particular **labels** from the index. `iloc` gets rows (or columns) at particular positions in the **`index`** (so it only takes integers).

In [62]:
new_df.iloc[[0, 1], [1, 2]]

          B         C
0  0.351516  0.747502
1  0.761380  0.739760

In [63]:
new_df.drop([2]).head(5)

          A         B         C         D         E
0   0.54321  0.351516  0.747502  0.252251  0.063048
1  0.560306  0.761380  0.739760  0.060856  0.165792
3   0.96547  0.957761  0.214800  0.884814  0.887049
4  0.946059  0.005710  0.167932  0.180200  0.388442
5  0.312122  0.545900  0.976535  0.880047  0.440441

In [64]:
new_df.drop(['A', 'C'], axis=1).head(5)

          B         D         E
0  0.351516  0.252251  0.063048
1  0.761380  0.060856  0.165792
2  0.879773  0.736851  0.203240
3  0.957761  0.884814  0.887049
4  0.005710  0.180200  0.388442

In [65]:
new_df.drop(['A', 'C'], axis=1, inplace=True)

In [66]:
new_df.head(5)

          B         D         E
0  0.351516  0.252251  0.063048
1  0.761380  0.060856  0.165792
2  0.879773  0.736851  0.203240
3  0.957761  0.884814  0.887049
4  0.005710  0.180200  0.388442

In [67]:
new_df.drop([1, 3], axis=0, inplace=True)

In [68]:
new_df.head(5)

          B         D         E
0  0.351516  0.252251  0.063048
2  0.879773  0.736851  0.203240
4  0.005710  0.180200  0.388442
5  0.545900  0.880047  0.440441
6  0.047417  0.682086  0.285437

In [69]:
new_df.reset_index()

     index         B         D         E
0        0  0.351516  0.252251  0.063048
1        2  0.879773  0.736851  0.203240
2        4  0.005710  0.180200  0.388442
3        5  0.545900  0.880047  0.440441
4        6  0.047417  0.682086  0.285437
..     ...       ...       ...       ...
293    295  0.940568  0.114394  0.821349
294    296  0.791238  0.341883  0.332195
295    297  0.209322  0.504221  0.694428
296    298  0.221617  0.074223  0.946116
297    299  0.063214  0.242679  0.443807

[298 rows x 4 columns]

In [70]:
new_df.reset_index(drop=True, inplace=True)

In [71]:
new_df.head(5)

          B         D         E
0  0.351516  0.252251  0.063048
1  0.879773  0.736851  0.203240
2  0.005710  0.180200  0.388442
3  0.545900  0.880047  0.440441
4  0.047417  0.682086  0.285437

In [72]:
new_df.loc[:, 'B'] = None

In [73]:
new_df['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
293    True
294    True
295    True
296    True
297    True
Name: B, Length: 298, dtype: bool

In [74]:
new_df.head(5)

      B         D         E
0  None  0.252251  0.063048
1  None  0.736851  0.203240
2  None  0.180200  0.388442
3  None  0.880047  0.440441
4  None  0.682086  0.285437

In [75]:
new_df.iloc[0, 0] = 1

In [76]:
new_df

        B         D         E
0       1  0.252251  0.063048
1    None  0.736851  0.203240
2    None  0.180200  0.388442
3    None  0.880047  0.440441
4    None  0.682086  0.285437
..    ...       ...       ...
293  None  0.114394  0.821349
294  None  0.341883  0.332195
295  None  0.504221  0.694428
296  None  0.074223  0.946116
297  None  0.242679  0.443807

[298 rows x 3 columns]

In [77]:
new_df['B'].isnull()

0      False
1       True
2       True
3       True
4       True
       ...
293     True
294     True
295     True
296     True
297     True
Name: B, Length: 298, dtype: bool

In [78]:
df = pd.DataFrame({'name':['Alfred', 'Batman', 'catwomen'],
                   'toy':[np.nan, 'Batmobile', 'Bullwhip'],
                   'born':[pd.NaT, pd.Timestamp('1940-04-25'), pd.NaT]
})

In [79]:
df.head()

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  catwomen   Bullwhip        NaT

In [80]:
df.dropna(how='all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  catwomen   Bullwhip        NaT

In [81]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [82]:
df_n = pd.DataFrame({'name':['Alfred', 'Batman', 'catwomen'],
                   'toy':[np.nan, np.nan, np.nan],
                   'born':[pd.NaT, pd.Timestamp('1940-04-25'), pd.NaT]
})

In [83]:
df_n

       name  toy       born
0    Alfred  NaN        NaT
1    Batman  NaN 1940-04-25
2  catwomen  NaN        NaT

In [84]:
df_n.dropna(how='all', axis=1)

       name       born
0    Alfred        NaT
1    Batman 1940-04-25
2  catwomen        NaT

## __Droping the Dupilicates__

In [85]:
df_x = pd.DataFrame({'name':['Alfred', 'Batman', 'Alfred'],
                   'toy':[np.nan, 'Batmobile', 'Bullwhip'],
                   'born':[pd.NaT, pd.Timestamp('1940-04-25'), pd.NaT]
})

In [86]:
df_x

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [87]:
df_x.drop_duplicates(subset=['name'])

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

In [88]:
df_x.drop_duplicates(subset=['name'], keep='last')

     name        toy       born
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [89]:
df_x.drop_duplicates(subset=['name'], keep=False)

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [90]:
df.shape

(3, 3)

In [91]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [92]:
df.describe()

          name        toy                 born
count        3          2                    1
unique       3          2                    1
top     Alfred  Batmobile  1940-04-25 00:00:00
freq         1          1                    1
first      NaN        NaN  1940-04-25 00:00:00
last       NaN        NaN  1940-04-25 00:00:00

In [93]:
df['name'].value_counts(dropna=False) # dropna=False i.e. we don't want to drop NaN

Alfred      1
Batman      1
catwomen    1
Name: name, dtype: int64

In [94]:
df['born'].value_counts(dropna=False)

NaT           2
1940-04-25    1
Name: born, dtype: int64

In [95]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  catwomen   Bullwhip        NaT

In [96]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

In [97]:
df.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True

__Statistical Analysis:__

```
df.describe()
df.mean()
df.corr()
df.count()
df.max()
df.min()
df.median()
df.std()
```

### __How to read an excel file in pandas?__

In [98]:
! wget https://dq-blog-files.s3.amazonaws.com/movies.xls

--2020-08-14 17:29:20--  https://dq-blog-files.s3.amazonaws.com/movies.xls
Resolving dq-blog-files.s3.amazonaws.com (dq-blog-files.s3.amazonaws.com)... 52.217.42.60
Connecting to dq-blog-files.s3.amazonaws.com (dq-blog-files.s3.amazonaws.com)|52.217.42.60|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 1871872 (1.8M) [application/vnd.ms-excel]
Saving to: ‘movies.xls’

movies.xls          100%[===================>]   1.79M  --.-KB/s    in 0.08s

2020-08-14 17:29:20 (21.6 MB/s) - ‘movies.xls’ saved [1871872/1871872]

In [99]:
data = pd.read_excel('/content/movies.xls', sheet_name='2000s')

In [100]:
data.head(3)

             Title  Year  ... Reviews by Crtiics IMDB Score
0  102 Dalmatians   2000  ...               84.0        4.8
1         28 Days   2000  ...              116.0        6.0
2       3 Strikes   2000  ...               22.0        4.0

[3 rows x 25 columns]

In [101]:
data.iloc[0,1] = 1984

In [102]:
data.head(3)

             Title  Year  ... Reviews by Crtiics IMDB Score
0  102 Dalmatians   1984  ...               84.0        4.8
1         28 Days   2000  ...              116.0        6.0
2       3 Strikes   2000  ...               22.0        4.0

[3 rows x 25 columns]

In [103]:
# Making the changes to the excel 
data.to_excel('/content/movies.xls', sheet_name='2000s')